/* ************************************************************************** */
/*                                                                            */
/*                                                        :::      ::::::::   */
/*   translate.c                                        :+:      :+:    :+:   */
/*                                                    +:+ +:+         +:+     */
/*   By: itakumi <itakumi@student.42tokyo.jp>       +#+  +:+       +#+        */
/*                                                +#+#+#+#+#+   +#+           */
/*   Created: 2025/07/28 17:25:46 by itakumi           #+#    #+#             */
/*   Updated: 2025/08/10 16:20:26 by itakumi          ###   ########.fr       */
/*                                                                            */
/* ************************************************************************** */

// XXX
#include <stdio.h>

#include "struct.h"

// 平行移動はどのような設計にしようか。
// ボタンが押されているときというのがあったはず，だからそのようなときに，連続して動くような仕様にする？
//
void	apply_trans(double matrix[4][4], double x, double y, double z)
{
	if (matrix == NULL)
		return ;


}
